II/ComponentEvolution_of_eigVecs/independent_Evolution_of_v_xz/tutorial/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes                                                                 
{
    default         Euler; 
}

gradSchemes
{
    default         Gauss linear;
    grad(U)	    Gauss linear;
    grad(p)	    Gauss linear;
    linExtrapGrad       Gauss linear;
}


divSchemes
{
    //div(phi,U)                                  Gauss linear upwind;
    div(phi,U)                 			GaussDefCmpw cubista;
    div(phi,((eigVecs_&eigVals_)&eigVecs_.T())) GaussDefCmpw cubista;
    div((nuEff*dev2(T(grad(U))))) 		Gauss linear;
    div(tau_p)					Gauss linear;
    div(grad(U))				Gauss linear;
    div(phi,eig1)                               GaussDefCmpw cubista;
    div(phi,eig2)                               GaussDefCmpw cubista;
    div(phi,eig3)				GaussDefCmpw cubista;
    div(phi,v11)				GaussDefCmpw cubista;
    div(phi,v21)				GaussDefCmpw cubista;
    div(phi,v13)				GaussDefCmpw cubista;
    div(phi,v23)                                GaussDefCmpw cubista;
    div(grad(v11))				Gauss linear;
    div(grad(v13))                              Gauss linear;
    div(grad(v21))                              Gauss linear;
    div(grad(v23))                              Gauss linear;

}

laplacianSchemes
{
    default		    Gauss linear orthogonal;         
    laplacian(U)	    Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;//orthogonal
}
fluxRequired
{
    default	no;
    p		;
}

// ************************************************************************* //
